qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
}

/**@brief Function that handles BLE write event
 *
 * @param[in]   peripheral_id    Id of peripheral for handling this event.
 * @param[in]   p_ble_evt        Pointer to buffer filled in with an event.
*/
static __INLINE void write_event_handle(ble_evt_t *p_ble_evt)
{
    uint16_t write_event_value_handle = 0;
    uint8_t  write_data               = 0;

    write_event_value_handle = p_ble_evt->evt.gatts_evt.params.write.context.value_handle;
    write_data = p_ble_evt->evt.gatts_evt.params.write.data[0];
    /* Verify write event */
    if (write_event_value_handle != gs_own_char_handle.value_handle)
    {
        LOG_DEBUG("BLE_GATTS_EVT_WRITE handle value 0x%x != 0x%x", write_event_value_handle, gs_own_char_handle.value_handle);
        return;
    }
    if ((write_data != WRITE_VALUE_ENABLE_NOTIFICATIONS) && (write_data != WRITE_VALUE_DISABLE_NOTIFICATIONS))
    {
        LOG_INFO("Central sent improper value.");
        LOG_DEBUG("BLE_GATTS_EVT_WRITE data 0x%x out of range {0x01,0x00}", write_data, BLE_GATTS_ATTR_TYPE_DESC);
        return;
    }
    if (write_data == WRITE_VALUE_ENABLE_NOTIFICATIONS)
    {
        ble_gap_conn_params_t new_conn_params = {0};
        
        gs_central.notification_enabled = 1;
        LOG_INFO("Sending notifications enabled.");

        if (!gs_central.cpu_request_done)
        {
            uint32_t error_code = NRF_ERROR_NOT_FOUND;
            
            /* Request change of connection parameters to peer central. */
            new_conn_params.min_conn_interval = CENTRAL_MIN_CONN_INTERVAL;
            new_conn_params.max_conn_interval = CENTRAL_MAX_CONN_INTERVAL;
            new_conn_params.slave_latency     = CENTRAL_SLAVE_LATENCY;
            new_conn_params.conn_sup_timeout  = CENTRAL_CONN_SUP_TIMEOUT;
            if ((error_code = sd_ble_gap_conn_param_update(gs_central.conn_handle, &new_conn_params)) != NRF_SUCCESS)
            {
                LOG_DEBUG("(Central) Updating connection parameters failed - error code = 0x%x", error_code);
            }
            gs_central.cpu_request_done = 1; /* Already requested. */
        }
    }
    else if (write_data == WRITE_VALUE_DISABLE_NOTIFICATIONS)
    {
        gs_central.notification_enabled = 0;
        LOG_INFO("Sending notifications disabled.");
    }
}

uint8_t background_test;

static void background_timeout_handler(void *p_context)
{
	background_test = 1;
}

// LED dimmer
static void led_dim_timeout_handler(void * p_context)
{
	uint8_t idx, delta;

	idx = *(uint8_t *)p_context;

	led_timeout_cnt[idx]++;
	if (led_start_cnt[idx] != led_timeout_cnt[idx]) {
		delta = 10;
	}

	led_step_period_remaining[idx]--;
	if (led_step_period_remaining[idx] == 0) {
		if (led_turning[idx] == 1) {
			led_current[idx] += led_step_size[idx];
		} else if (led_turning[idx] == 0xFF) {
			led_current[idx] -= led_step_size[idx];
		}
		//nrf_pwm_set_value(idx, led_current[idx]);

		if (led_step_cnt[idx] > 0) {
			led_step_cnt[idx]--;
		} else {
			return;
		}
		if (led_step_cnt[idx] == 0) {
			led_turning[idx] = 0;
			if (led_current[idx] != led_target[idx]) {
				led_error_cnt++;
			}

			uint8_t idx, all_done = 0;
			for (idx = 0; idx < 4; idx++) {
				if (led_step_cnt[idx] == 0) {
					all_done++;
				}
			}
			if (all_done == 4) {
				led_done = 1;
			}
			return;
		}

		if (led_target[idx] > led_current[idx]) {
			led_turning[idx] = 1;
			delta = led_target[idx] - led_current[idx];
		} else if (led_current[idx] > led_target[idx]) {
			led_turning[idx] = 0xFF;
			delta = led_current[idx] - led_target[idx];
		}

		if (delta <= led_step_cnt[idx]) {
			led_step_size[idx] = 1;
			led_step_period[idx] = led_step_cnt[idx] / delta;
			led_step_period_remaining[idx] = led_step_period[idx];
		} else {
			led_step_size[idx] = delta / led_step_cnt[idx];
			led_step_period[idx] = 1;
			led_step_period_remaining[idx] = 1;
		}
	} else {
		led_step_cnt[idx]--;
	}

	if (led_step_cnt[idx] > 0) {
		APP_ERROR_CHECK(app_timer_start(led_dim_timer_id[idx], LED_TIME_STEP_INTERVAL, &led_tag[idx]));
		led_start_cnt[idx]++;
	}
}

/*****************************************************************************
* Functions related to service setup, advertisement, discovery, device connection
*****************************************************************************/
/**@brief Function steup own service to be used to notify average values to peer central.
 *
 * Function does not return error code. If any internal call failes it triggers APP_ASSERT.
*/
static void services_init(void)
{
    APP_ERROR_CHECK(ble_memdump_init(&m_memdump));
    APP_ERROR_CHECK(ble_led_init(&m_led));
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
	uint8_t idx;

    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);

    for (idx = 0; idx < 4; idx++) {
    	APP_ERROR_CHECK(app_timer_create(&(led_dim_timer_id[idx]), APP_TIMER_MODE_SINGLE_SHOT, led_dim_timeout_handler));
    }

    APP_ERROR_CHECK(app_timer_create(&background_timer_id, APP_TIMER_MODE_REPEATED, background_timeout_handler));
    APP_ERROR_CHECK(app_timer_start(background_timer_id, APP_TIMER_TICKS(1000, APP_TIMER_PRESCALER), NULL));
}

static uint32_t adv_report_parse(uint8_t type, data_t * p_advdata, data_t * p_typedata)
{
    uint32_t index = 0;
    uint8_t * p_data;

    p_data = p_advdata->p_data;

    while (index < p_advdata->data_len)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type = p_data[index+1];

        if (field_type == type)
        {
            p_typedata->p_data = &p_data[index+2];
            p_typedata->data_len = field_length-1;
            return NRF_SUCCESS;
        }
        index += field_length+1;
    }
    return NRF_ERROR_NOT_FOUND;
}

static void hts_c_evt_handler(ble_hts_c_t * p_hts_c, ble_hts_c_evt_t * p_hts_c_evt)
{
    uint32_t err_code;

    switch (p_hts_c_evt->evt_type)
    {
        case BLE_HTS_C_EVT_DISCOVERY_COMPLETE:
            // Health Therometer Service discovered. Enable notification of Heart Rate Measurement.
            err_code = ble_hts_c_tm_idct_enable(p_hts_c);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_HTS_C_EVT_TM_INDICATION:
        {
            LOG_INFO("indication received");
            break;
        }
        default:
            break;
    }
}

static void hts_c_init(uint16_t conn_handle)
{
    ble_hts_c_init_t hts_c_init_obj;
    uint16_t peripheral_id = peripheral_id_get(conn_handle);

    hts_c_init_obj.evt_handler = hts_c_evt_handler;

    uint32_t err_code = ble_hts_c_init(conn_handle, 
                                        (peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].hts_c), 
                                        &hts_c_init_obj);
    APP_ERROR_CHECK(err_code);
}

static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    data_t adv_data;
    data_t type_data;
    uint32_t err_code = NRF_SUCCESS;
    uint16_t peripheral_id = 0;
    const ble_gap_evt_t   * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
            LOG_INFO("BLE_GAP_EVT_ADV_REPORT");

            // Initialize advertisement report for parsing.
            adv_data.p_data = (uint8_t *)p_gap_evt->params.adv_report.data;
            adv_data.data_len = p_gap_evt->params.adv_report.dlen;

            err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE,
                                        &adv_data,
                                        &type_data);
            if (err_code != NRF_SUCCESS)
            {
                // Compare short local name in case complete name does not match.
                err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE,
                                            &adv_data,
                                            &type_data);
            }

            // Verify if short or complete name matches target.
            if (err_code == NRF_SUCCESS)
            {
                uint16_t extracted_uuid;

                // UUIDs found, look for matching UUID
                for (uint32_t u_index = 0; u_index < (type_data.data_len/UUID16_SIZE); u_index++)
                {
                    UUID16_EXTRACT(&extracted_uuid,&type_data.p_data[u_index * UUID16_SIZE]);

