qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
                    if(extracted_uuid == TARGET_UUID)
                    {
                        // Stop scanning.
                        err_code = sd_ble_gap_scan_stop();
                        if (err_code != NRF_SUCCESS)
                        {
                            LOG_INFO("sd_ble_gap_scan_stop failed");
                        }
                        
                        // Initiate connection.
                        err_code = sd_ble_gap_connect(&p_gap_evt->params.adv_report.peer_addr,
                                                       &m_scan_param,
                                                       &m_connection_param);

                        if (err_code != NRF_SUCCESS)
                        {
                            LOG_INFO("Connection Request Failed, reason %d", err_code);
                        }
                        break;
                    }
                }
            }
            break;

        case BLE_GAP_EVT_CONNECTED:
            if (p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_PERIPH) {
                // Peer is central, we are peripheral
                connect_peer_central(p_ble_evt);
            } else {
                // Connected to peer peripheral
                uint16_t next_id = 0;

                LOG_INFO("Connected to peer peripheral");
                next_id = peripheral_get_available_id();
                if (next_id != ID_NOT_FOUND) {
                    gs_peripheral[next_id].conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                } else {
                    LOG_INFO("Cannot find available slot for peripheral");
                }

                // Initialize collector
                hts_c_init(p_ble_evt->evt.gap_evt.conn_handle);
            }
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            if (is_central(p_ble_evt->evt.gap_evt.conn_handle)) {
                // Disconnected with peer central
                central_info_reset();
                if (p_ble_evt->evt.gap_evt.params.disconnected.reason == BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION)
                {
                    LOG_INFO("Central disconnected. Connection terminated remotely.");
                }
                else
                {
                    LOG_INFO("Central disconnected.");
                    if (p_ble_evt->evt.gap_evt.params.disconnected.reason == BLE_HCI_CONNECTION_TIMEOUT)
                    {
                        LOG_INFO("Reason: Timeout");
                    }
                    LOG_DEBUG("Central disconnected (reason 0x%x).", p_ble_evt->evt.gap_evt.params.disconnected.reason);
                }
                advertising_start();
            }
            else
            {
                if ((peripheral_id = peripheral_id_get(p_ble_evt->evt.gap_evt.conn_handle)) == ID_NOT_FOUND ) {
                    LOG_DEBUG("Disconnect from unknown device (0x%x)", p_ble_evt->evt.gap_evt.conn_handle);
                } else {
                    if (peripheral_info_reset(peripheral_id) == NRF_ERROR_INVALID_PARAM) {
                        LOG_DEBUG("Peripheral information not reset - given invalid peripheral id (%i).", peripheral_id);
                    }

                    switch(p_ble_evt->evt.gap_evt.params.disconnected.reason) {
                        case BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION:
                            LOG_DEBUG("(Peripheral %i) Disconnected. Conection terminated remotely.", peripheral_id);
                            break;
                        case BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION:
                            LOG_DEBUG("(Peripheral %i) Disconnected by this device.", peripheral_id);
                            break;
                        case BLE_HCI_CONNECTION_TIMEOUT:
                            LOG_DEBUG("(Peripheral %i) Disconnected due to timeout.", peripheral_id);
                            break;
                        default:
                            LOG_DEBUG("(Peripheral %i) Disconnected (reason 0x%x)", peripheral_id, p_ble_evt->evt.gap_evt.params.disconnected.reason);
                            break;
                    }
                    LOG_INFO("(Peripheral %i) Disconnected.", peripheral_id);
                }
            }
            break;

        case BLE_GAP_EVT_TIMEOUT:

            break;

        case BLE_GATTS_EVT_TIMEOUT:
            if (p_ble_evt->evt.gatts_evt.params.timeout.src == BLE_GATT_TIMEOUT_SRC_PROTOCOL)
            {

            }
            break;

        // The following case is the key to CCCD issue
        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        	sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gatts_evt.conn_handle, NULL, 0);
        	break;

        default:
            // No implementation needed.
            break;
    }
}

static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    uint16_t peripheral_id;

    on_ble_evt(p_ble_evt);
    peripheral_id = peripheral_id_get(p_ble_evt->evt.common_evt.conn_handle);
    ble_db_discovery_on_ble_evt((peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].db_discovery), p_ble_evt);
	ble_memdump_on_ble_evt(&m_memdump, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    ble_hts_c_on_ble_evt((peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].hts_c), p_ble_evt);
    ble_led_on_ble_evt(&m_led, p_ble_evt);
}

static void on_sys_evt(uint32_t sys_evt)
{
    switch(sys_evt)
    {
        default:
            // No implementation needed.
            break;
    }
}

static void sys_evt_dispatch(uint32_t sys_evt)
{
    on_sys_evt(sys_evt);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code = 0;

    LOG_DEBUG("%s: Enabling SoftDevice...", __FUNCTION__);

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_RC_250_PPM_8000MS_CALIBRATION, false);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_UNKNOWN);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = PERIPHERAL_AND_MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = PERIPHERAL_AND_MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = PERIPHERAL_AND_SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = PERIPHERAL_AND_CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);

    APP_ERROR_CHECK(err_code);
}

static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;      // flag, appearance, service
    ble_advdata_t srdata;       // full device name
    uint8_t       flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    // FIXME: battery service is the place holder for Smart Lamp
    ble_uuid_t adv_uuids[] =
       {
           {BLE_UUID_LED_SERVICE, BLE_UUID_TYPE_BLE},
       };

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

